Revit 2026 API

# TextAlignMask Enumeration

---

An enumerated type listing all the Text align mask.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TextAlignMask
```
```vb
Public Enumeration TextAlignMask
```
```cpp
public enum class TextAlignMask
```
```fsharp
type TextAlignMask
```

| Member name | Value | Description |
| --- | --- | --- |
| horzAlignMask | 448 | The mask of the Text object being aligned in the horizontal direction. |
| vertAlignMask | 3,584 | The mask of the Text object being aligned in the vertical direction. |

#### Reference

Autodesk.Revit.DB Namespace